rpi5-1/20240119-0820-glibc/0-master/1000/pgbench-warmup-5-1000.log
pgbench (17devel)
transaction type: <builtin: select only>
scaling factor: 5
partition method: range
partitions: 1000
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 1174706
number of failed transactions: 0 (0.000%)
latency average = 1.634 ms
initial connection time = 40.604 ms
tps = 19582.660251 (without initial connection time)